<a href="https://colab.research.google.com/github/prjanarthanan/Pandas/blob/master/10mins_python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Object Creation**

In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.223080 -1.564496  0.033268 -0.745007
2013-01-02  1.828866 -0.611477  0.620864  1.468185
2013-01-03  1.070373 -1.115811  0.498416  0.245009
2013-01-04 -0.226097  0.292693  0.748852 -1.612913
2013-01-05  0.666173  0.060614 -1.554227 -0.046512
2013-01-06 -0.494368  1.020668 -0.672631  0.293582

In [5]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

**Viewing Data**

In [7]:
df.head()

                   A         B         C         D
2013-01-01 -1.223080 -1.564496  0.033268 -0.745007
2013-01-02  1.828866 -0.611477  0.620864  1.468185
2013-01-03  1.070373 -1.115811  0.498416  0.245009
2013-01-04 -0.226097  0.292693  0.748852 -1.612913
2013-01-05  0.666173  0.060614 -1.554227 -0.046512

In [8]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.226097  0.292693  0.748852 -1.612913
2013-01-05  0.666173  0.060614 -1.554227 -0.046512
2013-01-06 -0.494368  1.020668 -0.672631  0.293582

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df.to_numpy()

array([[-1.22308045, -1.56449634,  0.0332681 , -0.74500747],
       [ 1.82886582, -0.61147669,  0.62086423,  1.46818547],
       [ 1.0703731 , -1.11581102,  0.49841565,  0.24500895],
       [-0.22609729,  0.29269267,  0.74885218, -1.6129133 ],
       [ 0.66617326,  0.06061382, -1.55422748, -0.04651239],
       [-0.49436822,  1.02066814, -0.67263076,  0.29358159]])

In [12]:
df2.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [13]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [14]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.270311 -0.319635 -0.054243 -0.066276
std    1.121363  0.957569  0.899575  1.042509
min   -1.223080 -1.564496 -1.554227 -1.612913
25%   -0.427300 -0.989727 -0.496156 -0.570384
50%    0.220038 -0.275431  0.265842  0.099248
75%    0.969323  0.234673  0.590252  0.281438
max    1.828866  1.020668  0.748852  1.468185

**Transpose**
*Converting the index as column and column as index*

In [16]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.223080    1.828866    1.070373   -0.226097    0.666173   -0.494368
B   -1.564496   -0.611477   -1.115811    0.292693    0.060614    1.020668
C    0.033268    0.620864    0.498416    0.748852   -1.554227   -0.672631
D   -0.745007    1.468185    0.245009   -1.612913   -0.046512    0.293582

In [17]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.745007  0.033268 -1.564496 -1.223080
2013-01-02  1.468185  0.620864 -0.611477  1.828866
2013-01-03  0.245009  0.498416 -1.115811  1.070373
2013-01-04 -1.612913  0.748852  0.292693 -0.226097
2013-01-05 -0.046512 -1.554227  0.060614  0.666173
2013-01-06  0.293582 -0.672631  1.020668 -0.494368

In [18]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2013-01-06 -0.494368  1.020668 -0.672631  0.293582
2013-01-05  0.666173  0.060614 -1.554227 -0.046512
2013-01-04 -0.226097  0.292693  0.748852 -1.612913
2013-01-03  1.070373 -1.115811  0.498416  0.245009
2013-01-02  1.828866 -0.611477  0.620864  1.468185
2013-01-01 -1.223080 -1.564496  0.033268 -0.745007

In [19]:
 df.sort_values(by='B')

                   A         B         C         D
2013-01-01 -1.223080 -1.564496  0.033268 -0.745007
2013-01-03  1.070373 -1.115811  0.498416  0.245009
2013-01-02  1.828866 -0.611477  0.620864  1.468185
2013-01-05  0.666173  0.060614 -1.554227 -0.046512
2013-01-04 -0.226097  0.292693  0.748852 -1.612913
2013-01-06 -0.494368  1.020668 -0.672631  0.293582

 **Selection**

In [20]:
df['A']

2013-01-01   -1.223080
2013-01-02    1.828866
2013-01-03    1.070373
2013-01-04   -0.226097
2013-01-05    0.666173
2013-01-06   -0.494368
Freq: D, Name: A, dtype: float64

In [21]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.223080 -1.564496  0.033268 -0.745007
2013-01-02  1.828866 -0.611477  0.620864  1.468185
2013-01-03  1.070373 -1.115811  0.498416  0.245009

In [22]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.828866 -0.611477  0.620864  1.468185
2013-01-03  1.070373 -1.115811  0.498416  0.245009
2013-01-04 -0.226097  0.292693  0.748852 -1.612913